{
  "nav": {
    "home": "Home",
    "about": "About",
    "portfolio": "Portfolio",
    "contact": "Contact"
  },
  "home": {
    "greeting": "Hi, I'm Rafał",
    "introduction": "I'm a full-stack developer specializing in creating modern web applications.",
    "projects": "Projects",
    "contact": "Contact"
  },
  "about": {
    "title": "About Me",
    "history": "My professional journey is a continuous development towards creating better web solutions.",
    "historyHeader": "History",
    "skills": "I specialize in technologies such as React, TypeScript, Node.js, and modern CSS.",
    "skillsHeader": "Skills",
    "approach": "In my work, I follow the principle that nothing is impossible - every challenge is an opportunity to grow and find innovative solutions.",
    "approachHeader": "Approach"
  },
  "portfolio": {
    "title": "My Projects",
    "viewProject": "View Project",
    "viewCode": "View Code"
  },
  "contact": {
    "title": "Contact",
    "social": "Social Media",
    "info": "If you want to get in touch with me, feel free to contact me directly via email or through the contact form. You can see the rest of my projects on my GitHub",
    "form": {
      "name": "Full name",
      "email": "Email address",
      "message": "Message",
      "send": "Send message",
      "sending": "Sending...",
      "success": "Thank you for your message! We'll respond as soon as possible.",
      "errors": {
        "name": "Name is required",
        "email": "Email is required",
        "emailFormat": "Invalid email format",
        "message": "Message is required"
      }
    }
  },
  "technologies": {
    "title": "Technologies",
    "more": "Read more",
    "less": "Collapse text",
    "items": {
      "react": {
        "name": "React",
        "description": "I first encountered React when I started my professional career. Some of the frontend projects at my employer's company, including my team's main project, were written in this Facebook technology (yes, React was originally created for building Facebook!). So, I had to roll up my sleeves and learn how to use it! And it turned out to be so enjoyable that I started using React for my private frontend projects, including this portfolio website. It’s a technology I prefer to work with when creating the visual layer for clients. Thanks to this tool, I’m confident I can deliver whatever a client needs or dreams of!"
      },
      "java": {
        "name": "Java",
        "description": "Plain old Java... But why Java? I started my programming journey with C++, and during my studies, which I had just begun, we also initially worked with C++. However, in the second year, programming-related courses were taken over by Java and a very demanding instructor... who made me dive deep into Java! I started creating private projects in it (my old Sudoku in Swing can still be found on my GitHub!) and delving further into its possibilities, including Spring, which, as it turned out, is practically a must-have when working with Java. It was Java that landed me my first job, with a client I still work with today. The client's main backend projects are written in Java and C++, and I am, of course, responsible for the Java-based projects,"
      },
      "db": {
        "name": "Databases",
        "description": "If a project requires me to create a database, I most often choose SQL-based solutions, particularly MySQL. It has never let me down so far, and I’ve successfully handled all my private projects with it to my full satisfaction. When I found out that Facebook also uses MySQL, it only reinforced my choice of this technology. At my full-time job, I also work with Oracle and MariaDB/HeidiSQL databases, but in my private projects, I’m a true MySQLover!"
      },
      "js": {
        "name": "JavaScript & TypeScript",
        "description": "Why do I mention them together? Well, because they are very interchangeable and intertwined for me. TypeScript is, in fact, an extension of JavaScript that adds static typing and other advanced features, but code written in JavaScript can be used in TypeScript without any changes. In my private projects, I more often choose TypeScript, but my main client uses JavaScript, so at this point in my experience, I have a certain balance, although I have worked with JavaScript for a longer time."
      },
      "express": {
        "name": "Express.js",
        "description": "I have been using Express.js relatively recently, but it has become my favorite solution for projects that need a server connecting to, for example, a database, but are not large enough to build a project in Java. The Express.js server is fast, easy to set up, run, and deploy necessary functions, making it easier to solve potential problems. And usually, the simplest solution is the best one"
      },
      "ai": {
        "name": "AI",
        "description": "In my projects, I also work with a relatively new field of technology, namely AI tools. My favorites include ClaudeAI, ChatGPT, and V0. These tools help optimize my development process by generating templates, presenting ready-made solutions, and detecting errors. As of today, these technologies are an essential part of my toolkit, allowing me to speed up my work and deliver fully functional solutions."
      }
    }
  },
  "projects": {
    "photographer-website": {
      "title": "Photographer Website",
      "description": "My first website that went live on the internet! Currently, due to redevelopment, it is a bit stripped down, but you can still view it at the address below."
    },
    "bike-shop": {
      "title": "Bike Shop",
      "description": "My first complete store, featuring everything needed for an online business. Admin panels, customer accounts, a product database, and the ability to handle the shopping cart along with payments."
    }

  }
}