{
  "nav": {
    "home": "Strona główna",
    "about": "O mnie",
    "portfolio": "Portfolio",
    "contact": "Kontakt"
  },
  "home": {
    "greeting": "Cześć, jestem Rafał",
    "introduction": "Jestem full-stack developerem specjalizującym się w tworzeniu nowoczesnych aplikacji internetowych.",
    "projects": "Projekty",
    "contact": "Kontakt"
  },
  "about": {
    "title": "Co oferuję",
    "info": "Stworzenie dla nowoczesnej i unikalnej strony internetowej, która wyróżni Cię w sieci. Zaprojektuję spójną identyfikację wizualną podkreślającą charakter Twojej marki oraz wykonam wszelkie czynności potrzebne aby strona znalazła się w sieci. Moje szczególnie ulubione rodzaje projektów to:",
    "firstHeader": "Strony firmowe",
    "first": "Profesjonalne strony internetowe stworzone z myślą o budowaniu wizerunku marki w sieci. Zawierają wszystkie niezbędne elementy, aby firma mogła skutecznie zaprezentować swoje usługi i nawiązywać kontakt z klientami. To idealne rozwiązanie dla przedsiębiorstw stawiających na przejrzystość i prostotę.",
    "secondHeader": "Strony promocyjne",
    "second": "Skoncentrowane na realizacji konkretnego celu – czy to promocji produktu, usługi, czy budowania bazy klientów. Takie strony zachęcają do działania dzięki przemyślanemu układowi i przyciągającemu uwagę designowi.",
    "thirdHeader": "Blogi i portale tematyczne",
    "third": "Strony idealne do dzielenia się wiedzą, inspiracjami lub pasjami. Stawiamy na przejrzystość, wygodę użytkowania oraz spójność wizualną, co pozwala na budowanie zaangażowanej społeczności wokół treści."
  },
  "portfolio": {
    "title": "Moje projekty",
    "viewProject": "Zobacz stronę",
    "viewCode": "Zobacz kod"
  },
  "contact": {
    "title": "Kontakt",
    "social": "Media społecznościowe",
    "info": "Jeżeli chcesz się ze mną skontaktować zapraszam do kontaktu bezpośrednio przez email lub formularz kontaktowy. Resztę moich projektów można zobaczyć na moim GitHubie",
    "form": {
      "name": "Imię",
      "email": "Adres email",
      "message": "Wiadomość",
      "send": "Wyślij wiadomość",
      "sending": "Wysyłanie...",
      "success": "Dziękuję za wiadomość! Odpowiem najszybciej jak to możliwe",
      "error": "Przepraszam, nie udało się wysłać wiadomości. Spróbuj ponownie za chwilę, a jeśli problem się powtórzy, zapraszam do kontaktu mailowego",
      "errors": {
        "name": "Imię jest wymagane",
        "email": "Email jest wymagany",
        "emailFormat": "Nieprawidłowy format email",
        "message": "Wiadomość jest wymagana"
      }
    }
  },
  "technologies": {
    "title": "Technologie",
    "more": "Czytaj dalej",
    "less": "Zwiń tekst",
    "items": {
      "react": {
        "name": "React",
        "description": "Z Reactem spotkałem się dopiero, gdy rozpocząłem moją pracę zawodową. Część projektów frontendowych u mojego pracodawcy, w tym główny projekt mojego zespołu, zostało napisana właśnie w tej technologii facebookowej (tak, React został stworzony na potrzeby budowy Facebooka!). Więc trzeba było zakasać rękawy i nauczyć się, z czym to się je! A okazało się to na tyle satysfakcjonujące, że właśnie w Reakcie zacząłem tworzyć swoje prywatne projekty frontendowe, w tym tę stronę z moim portfolio. Jest to technologia, w której preferuję pracować, gdy tworzę warstwę wizualną dla klienta. Dzięki temu narzędziu jestem pewien, że potrafię zrealizować to, czego klient potrzebuje lub o czym tylko marzy!"
      },
      "java": {
        "name": "Java",
        "description": "Stara, dobra Java... Ale dlaczego właśnie Java? Swoją przygodę z programowaniem zacząłem od C++, a na studiach, które dopiero co zaczynałem, również początkowo pracowaliśmy z C++. Jednak na drugim roku przedmioty związane z programowaniem przejęła Java i bardzo wymagająca prowadząca... która sprawiła, że wsiąkłem w Javę! Zacząłem tworzyć w niej prywatne projekty (stare Sudoku w Swingu wciąż można zobaczyć na moim GitHubie!) i coraz bardziej zagłębiać się w jej możliwości, w tym w Springa, który – jak się okazało – jest praktycznie obowiązkowy w pracy z Javą. To właśnie w Javie znalazłem swoją pierwszą pracę, u klienta, z którym współpracuję do dziś. Główne projekty backendowe tego klienta są pisane w Javie oraz C++, a ja odpowiadam oczywiście za część Javową i jestem z nią związany do dziś!"
      },
      "db": {
        "name": "Bazy danych",
        "description": "Jeżeli tworzony projekt wymaga utworzenia bazy danych, najchętniej sięgam po bazy SQL-owe, a szczególnie po MySQL-a. Do tej pory nigdy mnie nie zawiódł, a wszystkie moje prywatne projekty obsłużyłem nim w pełni satysfakcjonująco. Kiedy dowiedziałem się, że z MySQL-a korzysta Facebook, tylko utwierdziłem się w swoim wyborze technologii. W pracy etatowej wykorzystuję również bazy Oracle oraz MariaDB/HeidiSQL, ale w prywatnych projektach jestem prawdziwym MySQLoverem!"
      },
      "js": {
        "name": "JavaScript & TypeScript",
        "description": "Dlaczego dodaję je razem? A no dlatego, że są one dla mnie bardzo zamienne i splecione ze sobą. TypeScript, jest de facto rozszerzeniem JavaScriptu, które dodaje statyczne typowanie oraz inne zaawansowane funkcje, za to kod napisany w JavaScript może być użyty w TypeScript bez żadnych zmian. W swoich prywatnych projektach częsciej wybieram TypeScript ale mój główny klient korzysta z JavaScriptu, więc w moim doświadczeniu na ten moment mam pewne zbalansowanie, chociaż z JavaScriptem, współpracuję dłużej."
      },
      "express": {
        "name": "Express.js",
        "description": "Express.js stosuję stosunkowo od niedawna, jednak jest to moje ulubione rozwiązanie w projektach, które muszą mieć serwer łączący się np. z bazą danych, ale nie są na tyle duże, żeby budować projekt w Javie. Serwer Express.js jest szybki, prosty do postawienia, uruchomienia oraz wdrożenia potrzebnych funkcji, a dzięki temu łatwiej rozwiązać potencjalne problemy. A zazwyczaj proste rozwiązanie to najlepsze rozwiązanie!"
      },
      "ai": {
        "name": "AI",
        "description": "W swoich projektach korzystam również z całkiem nowej dziedziny technologii, jaką są narzędzia AI. Do moich ulubionych należą ClaudeAI, ChatGPT oraz V0. Narzędzia te pomagają mi w optymalizacji procesu tworzenia, poprzez generowanie szablonów, prezentowanie gotowych rozwiązań oraz wykrywania błędów. Na dzień dzisiejszy technologie te stanowią istotną część mojego zestawu narzędzi, umożliwiając mi przyspieszenie pracy oraz dostarczanie w pełni działających rozwiązań."
      }
    }
  },
  "projects": {
    "photographer-website": {
      "title" : "Strona dla fotografa",
      "description": "Moja pierwsza strona która znalazła się w internecie! Aktualnie z powodu przebudowy jest trochę okrojona ale w dalszym ciągu można ją zobaczyć pod poniższym adresem"
    },
    "bike-shop": {
      "title" : "Sklep rowerowy",
      "description": "Mój pierwszy kompletny sklep posiadający wszystko czego potrzeba internetowemu biznesowi. Panele administratora, konta klientów, baza danych z towarem oraz możliwość obsługi koszyka wraz z płatnościami."
    },
    "sweet-creations": {
      "title": "Hanuskowy Torcik",
      "description": "Strona internetowa prezentująca wypieki mojej żony! Zaprojektowana, aby pokazać jej twórczość i umożliwić łatwy kontakt z nią. Proste portfolio i wizytówka w jednym."
    }
  },
  "notifications": {
    "success": "Email został skopiowany do schowka!"
  }
}
